Zhuohao-Li/embedded-system/2A/code/RTE/Device/TM4C1294NCPDT/startup_TM4C129 2.s
I2C4_Handler\
                PROC
                EXPORT  I2C4_Handler [WEAK]
                B       .
                ENDP

I2C5_Handler\
                PROC
                EXPORT  I2C5_Handler [WEAK]
                B       .
                ENDP

GPIOM_Handler\
                PROC
                EXPORT  GPIOM_Handler [WEAK]
                B       .
                ENDP

GPION_Handler\
                PROC
                EXPORT  GPION_Handler [WEAK]
                B       .
                ENDP

TAMPER_Handler\
                PROC
                EXPORT  TAMPER_Handler [WEAK]
                B       .
                ENDP

GPIOP0_Handler\
                PROC
                EXPORT  GPIOP0_Handler [WEAK]
                B       .
                ENDP

GPIOP1_Handler\
                PROC
                EXPORT  GPIOP1_Handler [WEAK]
                B       .
                ENDP

GPIOP2_Handler\
                PROC
                EXPORT  GPIOP2_Handler [WEAK]
                B       .
                ENDP

GPIOP3_Handler\
                PROC
                EXPORT  GPIOP3_Handler [WEAK]
                B       .
                ENDP

GPIOP4_Handler\
                PROC
                EXPORT  GPIOP4_Handler [WEAK]
                B       .
                ENDP

GPIOP5_Handler\
                PROC
                EXPORT  GPIOP5_Handler [WEAK]
                B       .
                ENDP

GPIOP6_Handler\
                PROC
                EXPORT  GPIOP6_Handler [WEAK]
                B       .
                ENDP

GPIOP7_Handler\
                PROC
                EXPORT  GPIOP7_Handler [WEAK]
                B       .
                ENDP

GPIOQ0_Handler\
                PROC
                EXPORT  GPIOQ0_Handler [WEAK]
                B       .
                ENDP

GPIOQ1_Handler\
                PROC
                EXPORT  GPIOQ1_Handler [WEAK]
                B       .
                ENDP

GPIOQ2_Handler\
                PROC
                EXPORT  GPIOQ2_Handler [WEAK]
                B       .
                ENDP

GPIOQ3_Handler\
                PROC
                EXPORT  GPIOQ3_Handler [WEAK]
                B       .
                ENDP

GPIOQ4_Handler\
                PROC
                EXPORT  GPIOQ4_Handler [WEAK]
                B       .
                ENDP

GPIOQ5_Handler\
                PROC
                EXPORT  GPIOQ5_Handler [WEAK]
                B       .
                ENDP

GPIOQ6_Handler\
                PROC
                EXPORT  GPIOQ6_Handler [WEAK]
                B       .
                ENDP

GPIOQ7_Handler\
                PROC
                EXPORT  GPIOQ7_Handler [WEAK]
                B       .
                ENDP

GPIOR_Handler\
                PROC
                EXPORT  GPIOR_Handler [WEAK]
                B       .
                ENDP

GPIOS_Handler\
                PROC
                EXPORT  GPIOS_Handler [WEAK]
                B       .
                ENDP

SHAMD5_Handler\
                PROC
                EXPORT  SHAMD5_Handler [WEAK]
                B       .
                ENDP

AES_Handler\
                PROC
                EXPORT  AES_Handler [WEAK]
                B       .
                ENDP

DES3DES_Handler\
                PROC
                EXPORT  DES3DES_Handler [WEAK]
                B       .
                ENDP

LCDCONTROLLER_Handler\
                PROC
                EXPORT  LCDCONTROLLER_Handler [WEAK]
                B       .
                ENDP

TIMER6A_Handler\
                PROC
                EXPORT  TIMER6A_Handler [WEAK]
                B       .
                ENDP

TIMER6B_Handler\
                PROC
                EXPORT  TIMER6B_Handler [WEAK]
                B       .
                ENDP

TIMER7A_Handler\
                PROC
                EXPORT  TIMER7A_Handler [WEAK]
                B       .
                ENDP

TIMER7B_Handler\
                PROC
                EXPORT  TIMER7B_Handler [WEAK]
                B       .
                ENDP

I2C6_Handler\
                PROC
                EXPORT  I2C6_Handler [WEAK]
                B       .
                ENDP

I2C7_Handler\
                PROC
                EXPORT  I2C7_Handler [WEAK]
                B       .
                ENDP

HIMSCANKEYBOARD_Handler\
                PROC
                EXPORT  HIMSCANKEYBOARD_Handler [WEAK]
                B       .
                ENDP

ONEWIRE_Handler\
                PROC
                EXPORT  ONEWIRE_Handler [WEAK]
                B       .
                ENDP

HIMPS2_Handler\
                PROC
                EXPORT  HIMPS2_Handler [WEAK]
                B       .
                ENDP

HIMLEDSEQUENCER_Handler\
                PROC
                EXPORT  HIMLEDSEQUENCER_Handler [WEAK]
                B       .
                ENDP

HIMCONSUMERIR_Handler\
                PROC
                EXPORT  HIMCONSUMERIR_Handler [WEAK]
                B       .
                ENDP

I2C8_Handler\
                PROC
                EXPORT  I2C8_Handler [WEAK]
                B       .
                ENDP

I2C9_Handler\
                PROC
                EXPORT  I2C9_Handler [WEAK]
                B       .
                ENDP

GPIOT_Handler\
                PROC
                EXPORT  GPIOT_Handler [WEAK]
                B       .
                ENDP


                ALIGN


; User Initial Stack & Heap

                IF      :DEF:__MICROLIB

                EXPORT  __initial_sp
                EXPORT  __heap_base
                EXPORT  __heap_limit

                ELSE

                IMPORT  __use_two_region_memory
                EXPORT  __user_initial_stackheap
__user_initial_stackheap

                LDR     R0, =  Heap_Mem
                LDR     R1, =(Stack_Mem + Stack_Size)
                LDR     R2, = (Heap_Mem +  Heap_Size)
                LDR     R3, = Stack_Mem
                BX      LR

                ALIGN

                ENDIF


                END
